src/OpenFOAM/OpenFOAM-7/tutorials/combustion/fireFoam/LES/smallPoolFire3D/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    O2
    H2O
    CH4
    CO2
    N2
);

reactions
{
    propaneReaction
    {
        type         irreversibleinfiniteReaction;
        reaction      "CH4 + 2O2 + 7.5N2 = CO2 + 2H2O + 7.5N2";
    }
}


// ************************************************************************* //
