src/OpenFOAM/OpenFOAM-7/tutorials/combustion/fireFoam/LES/smallPoolFire3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 0   -0.5)
    ( 0.5 0   -0.5)
    ( 0.5 1.0 -0.5)
    (-0.5 1.0 -0.5)
    (-0.5 0    0.5)
    ( 0.5 0    0.5)
    ( 0.5 1.0  0.5)
    (-0.5 1.0  0.5)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (0 1 2 3)
            (1 5 6 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
